Repository: 21CSM/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/advanced.po
Languages: sq

source: Advanced Usage
sq: Përdorim i Thelluar

source: Save Tabs
sq: Ruani Skeda

source: Closing OnionShare tabs you host destroys them, preventing reuse. Persistently hosted websites are available on the same address even if the computer they are shared from is rebooted.
sq: Mbyllja e skedave OnionShare që keni hapur i asgjëson ato, duke parandaluar ripërdorimin. Sajte të strehuar për të mbetur, mund të kihen në të njëjtën adresë, edhe nëse kompjuteri prej të cilit jepen riniset.

source: Make any tab persistent by checking the "Always open this tab when OnionShare is started" box before starting your server.
sq: Bëjeni të mbetet cilëndo skedë duke i vënë shenjë kutizës “Hape përherë këtë skedë, kur niset OnionShare-i”, para se të nisni shërbyesin tuaj.

source: When opening OnionShare, your saved tabs from the prior session will start opened. Each service then can be started manually, and will be available on the same OnionShare address and be protected by the same private key.
sq: Kur hapet OnionShare, skedat tuaja të ruajtura prej sesionit të mëparshëm do të nisen të hapura. Mandej, çdo shërbim mund të niset dorazi dhe do të mund të përdoret në të njëjtën adresë OnionShare dhe do të mbrohet me të njëjtin kyç privat.

source: If you save a tab, a copy of its onion service secret key is stored on your computer.
sq: Nëse ruani një skedë, një kopje e kyçit të fshehtë të shërbimit Onion për të depozitohet në kompjuterin tuaj.

source: Turn Off Private Key
sq: Çaktivizo kyç Privat

source: By default, all OnionShare services are protected with a private key, which Tor calls "client authentication".
sq: Si parazgjedhje, krejt shërbimet OnionShare mbrohen me një kyç privat, të cilin Tor-i e quan “mirëfilltësim klienti”.

source: The Tor Browser will ask you to enter your private key when you load an OnionShare service. If you want allow the public to use your service, it's better to disable the private key altogether.
sq: Shfletuesi Tor do t’ju kërkojë të jepni kyçin tuaj privat, kur ngarkoni një shërbim OnionShare. Nëse doni të lejoni publikun të përdorë shërbimin tuaj, është më mirë ta çaktivizoni fare kyçin e privat.

source: To turn off the private key for any tab, check the "This is a public OnionShare service (disables private key)" box before starting the server. Then the server will be public and a private key is not needed to load it in the Tor Browser.
sq: Që të çaktivizoni kyçin privat të cilësdo skedë, i vini shenjë kutizës “Ky është një shërbim OnionShare publik (çaktivizohet kyçi privat)”, para nisjes së shërbyesit. Mandej shërbyesi do të jetë publik dhe s’duhet kyç privat për t’u ngarkuar te Shfletuesi Tor.

source: Custom Titles
sq: Tituj Vetjakë

source: When people load OnionShare services in the Tor Browser they see the default title for each type of service. For example, the default title for chat services is "OnionShare Chat".
sq: Kur njerëzit ngarkojnë shërbime OnionShare te Shfletuesi Tor, shohin titullin parazgjedhje për çdo lloj shërbimi. Për shembull, titulli parazgjedhje për shërbime fjalosjeje është ”OnionShare Chat”.

source: If you edit the "Custom title" setting before starting a server you can change it.
sq: Mund ta ndryshoni nëse përpunoni rregullimin “Titull vetjak” para nisjes së shërbyesit.

source: Scheduled Times
sq: Kohë të Planifikuara

source: OnionShare supports scheduling exactly when a service should start and stop. Before starting a server, click "Show advanced settings" in its tab and then check the boxes next to either "Start onion service at scheduled time", "Stop onion service at scheduled time", or both, and set the respective desired dates and times.
sq: OnionShare-i mbulon planifikim të përpiktë se kur duhet nisur dhe ndalur një shërbim. Para nisjes së një shërbyesi, klikoni mbi “Shfaq rregullime të mëtejshme” te skeda e tij dhe mandej u vini shenjë kutizave në krah të “Nise shërbimin Onion në kohën e planifikuar”, "Ndale shërbimin Onion në kohën e planifikuar", ose të dyja dhe caktoni data dhe kohët e dëshiruara përkatëse.

source: Services scheduled to start in the future display a countdown timer when when the "Start sharing" button is clicked. Services scheduled to stop in the future display a countdown timer when started.
sq: Shërbimet e planifikuara të nisin në të ardhmen shfaqin një matës kohëmbarimi, kur klikohet butoni “Nis ndarjen me të tjerë”. Shërbimet e planifikuara të ndalen në të ardhmen shfaqin një matës kohëmbarimi, kur nisen.

source: **Scheduling an OnionShare service to automatically start can be used as a dead man's switch**. This means your service is made public at a given time in the future if you are not there to prevent it. If nothing happens to you, you can cancel the service before it's scheduled to start.
sq: **Planifikimi i nisjes së automatizuar të një shërbimi OnionShare mund të përdoret si “çelësi i të vdekurit”**. Kjo do të thotë se shërbimi juaj bëhet publik në një kohë të dhënë në të ardhmen, nëse s’jeni atje për ta parandaluar këtë gjë. Nëse s’ju ndodh gjë dhe jeni gjallë, mund ta anuloni shërbimin para kohës së planifikuar për nisje.

source: **Scheduling an OnionShare service to automatically stop limits its exposure**. If you want to share secret info or something that will be outdated, you can do so for selected limited time.
sq: **Planifikimi i ndaljes së automatizuar të një shërbimi OnionShare kufizon ekspozimin e tij**. Nëse doni të ndani me të tjerë informacion të fshehtë, ose dika që do të vjetrohet, mund ta bëni këtë për një kohë të përzgjedhur.

source: Command-line Interface
sq: Ndërfaqe rreshti urdhrash

source: In addition to its graphical interface, OnionShare has a command-line interface.
sq: Tej ndërfaqes së vet grafike, OnionShare ka edhe një ndërfaqe “rresht urdhrash”.

source: You can install just the command-line version of OnionShare using ``pip3``::
sq: Mund të instaloni thjesht versionin “rresht urdhrash” të OnionShare-it duke përdorur ``pip3``::

source: Note that you will also need the ``tor`` package installed. In macOS, install it with: ``brew install tor``
sq: Vini re se do t’ju duhet të keni të instaluar edhe paketën ``tor``. Në macOS, instalojeni me: ``brew install tor``

source: Then run it like this::
sq: Mandej ekzekutojeni kështu:

source: Info about installing it on different operating systems can be found in the `CLI README file <https://github.com/onionshare/onionshare/blob/develop/cli/README.md>`_ in the Git repository.
sq: Informacion rreth instalimi në sisteme të ndryshme operative mund të gjenden te `kartela CLI READMEe <https://github.com/onionshare/onionshare/blob/develop/cli/README.md>`_ te depoja Git.

source: If you installed OnionShare using the Snap package, you can also just run ``onionshare.cli`` to access the command-line interface version.
sq: Nëse e instaluar OnionShare-in duke përdorur paketën Snap, mund të ekzekutoni thjesht ``onionshare.cli`` që të përdorni versionin me ndërfaqe “rresht urdhrash”.

source: Usage
sq: Përdorim

source: Browse the command-line documentation by running ``onionshare --help``::
sq: Shfletoni dokumentimin për versionin “rresht urdhrash” duke ekzekutuar ``onionshare --help``::

source: Keyboard Shortcuts
sq: Shkurtore Tastiere

source: The OnionShare desktop application contains some keyboard shortcuts, for convenience and accessibility::
sq: Aplikacioni OnionShare për desktop ka disa shkurtore tastiere, për leverdi dhe përdorim nga persona me aftësi të kufizuara::

source: And from the main mode chooser screen::
sq: Dhe prej skenës kryesore të zgjedhësit të mënyrës::
